In [1]:
# Write a Pandas program to print a concise summary of the dataset

In [2]:
import numpy as  np
import pandas as pd

In [3]:
df = pd.read_csv("D:/tested.csv")

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [5]:
# Write a Pandas program to extract the column labels, shape and data types of the

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
df.shape

(418, 12)

In [9]:
#  Write a Pandas program to create a Pivot table with multiple indexes from the data set of titanic.csv.

In [10]:
pt = pd.pivot_table(df,index=["Sex","Age"], aggfunc=np.sum)
pt

                        Cabin Embarked      Fare
Sex    Age
female 0.17                 0        S   20.5750  \
       0.92                 0        S   27.7500
       1.00                G6      SSC   70.4625
       2.00                 0        S   20.2125
       3.00                 0        S   13.7750
...                       ...      ...       ...
male   61.00  B57 B59 B63 B66       CQ  274.7250
       62.00                0        Q    9.6875
       63.00                0        S   26.0000
       64.00              D37        C   75.2500
       67.00          C55 C57        S  221.7792

                                                           Name  Parch
Sex    Age
female 0.17             Dean, Miss. Elizabeth Gladys Millvina""      2  \
       0.92                               West, Miss. Barbara J      2
       1.00   Sandstrom, Miss. Beatrice IreneKlasen, Miss. G...      4
       2.00                         Rosblom, Miss. Salli Helena      1
       3.00                           Peacock, Miss. Treasteall      1
...                                                         ...    ...
male   61.00        Ryerson, Mr. Arthur LarnedLingane, Mr. John      3
       62.00                          Myles, Mr. Thomas Francis      0
       63.00                               Howard, Mr. Benjamin      0
       64.00                           Warren, Mr. Frank Manley      0
       67.00                                 Straus, Mr. Isidor      0

              PassengerId  Pclass  SibSp  Survived                      Ticket
Sex    Age
female 0.17          1246       3      1         1                   C.A. 2315
       0.92          1142       2      1         1                  C.A. 34651
       1.00          3352       8      3         3  PP 9549350405SC/Paris 2123
       2.00          1176       3      1         1                      370129
       3.00          1301       3      1         1          SOTON/O.Q. 3101315
...                   ...     ...    ...       ...                         ...
male   61.00         2119       3      1         0              PC 17608235509
       62.00          894       2      0         0                      240276
       63.00          905       2      1         0                       24065
       64.00         1128       1      1         0                      110813
       67.00          973       1      1         0                    PC 17483

[115 rows x 10 columns]